# Importing Required Libraries

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# Loading the Dataset

In [2]:
data = pd.read_csv('../merged_file.csv')
data.head()

               DATE  B.FAST  LUNCH  Snacks   DINNER
0  01-05-2023 00:00   111.0  195.0   108.0    137.0
1  02-05-2023 00:00    95.0  175.0   115.0    138.0
2  03-05-2023 00:00    95.0  203.0   129.0    134.0
3  04-05-2023 00:00    93.0  184.0   131.0    179.0
4  05-05-2023 00:00   112.0  121.0    95.0    117.0

In [3]:
# concatenating another dataset
data2 = pd.read_excel('../../../../SALE PLAKSHA UNIVERSITY 08.2023-.xlsx')
# deleting the first four rows
data2 = data2.iloc[4:]
# renaming the columns
data2.columns = ['DATE', 'B.FAST', 'LUNCH', 'Snacks', 'DINNER']
data2.head()

                  DATE B.FAST LUNCH Snacks DINNER
4  2023-08-01 00:00:00     36    39     34     49
5  2023-08-02 00:00:00     43    42     38     41
6  2023-08-03 00:00:00     34    43     32     34
7  2023-08-04 00:00:00     34    51     39     45
8  2023-08-05 00:00:00     54    81     23     39

In [4]:
len(data)

99

In [5]:
# changing the column names to lower case
data.columns = data.columns.str.lower()
data2.columns = data2.columns.str.lower()

In [6]:
def format_columns(data):
    data.columns = data.columns.str.lower()
    data.rename(columns={'b.fast':'breakfast'}, inplace=True)
    data.rename(columns={' dinner':'dinner'}, inplace=True)
    return data

In [7]:
data = format_columns(data)
data.head()

               date  breakfast  lunch  snacks  dinner
0  01-05-2023 00:00      111.0  195.0   108.0   137.0
1  02-05-2023 00:00       95.0  175.0   115.0   138.0
2  03-05-2023 00:00       95.0  203.0   129.0   134.0
3  04-05-2023 00:00       93.0  184.0   131.0   179.0
4  05-05-2023 00:00      112.0  121.0    95.0   117.0

In [8]:
data2 = format_columns(data2)
data2.head()

                  date breakfast lunch snacks dinner
4  2023-08-01 00:00:00        36    39     34     49
5  2023-08-02 00:00:00        43    42     38     41
6  2023-08-03 00:00:00        34    43     32     34
7  2023-08-04 00:00:00        34    51     39     45
8  2023-08-05 00:00:00        54    81     23     39

In [9]:
# getting all rows with null values
null_rows = data[data.isnull().any(axis=1)]
null_rows

   date  breakfast  lunch  snacks  dinner
92  NaN        NaN    NaN     NaN     NaN
93  NaN        NaN    NaN     NaN     NaN
94  NaN        NaN    NaN     NaN     NaN
95  NaN        NaN    NaN     NaN     NaN
96  NaN        NaN    NaN     NaN     NaN
97  NaN        NaN    NaN     NaN     NaN
98             NaN    NaN     NaN     NaN

In [10]:
null_rows2 = data2[data2.isnull().any(axis=1)]
null_rows2

      date breakfast lunch snacks dinner
35     NaN      5842  8918   4945   7056
36  THALI-       NaN   NaN    NaN    NaN
41     NaN       NaN   NaN    NaN    NaN
42     NaN       NaN   NaN    NaN    NaN
43     NaN       NaN   NaN    NaN    NaN
44     NaN       NaN   NaN    NaN    NaN
45     NaN       NaN   NaN    NaN    NaN
46     NaN       NaN   NaN    NaN    NaN
47     NaN       NaN   NaN    NaN    NaN
48               NaN   NaN    NaN    NaN

In [11]:
data2 = data2.dropna()
# dropping the last 4 rows
data2 = data2[:-4]
data2.tail()

                   date breakfast lunch snacks dinner
30  2023-08-27 00:00:00       155   371    175    310
31  2023-08-28 00:00:00       271   450    265    341
32  2023-08-29 00:00:00       237   402    312    356
33  2023-08-30 00:00:00       224   377    278    374
34  2023-08-31 00:00:00       198   327    251    272

In [12]:
# removing null rows
data = data.dropna()
data.tail()

                date  breakfast  lunch  snacks  dinner
87  27-07-2023 00:00       37.0   51.0    33.0    54.0
88  28-07-2023 00:00       48.0   68.0    44.0    59.0
89  29-07-2023 00:00       45.0   39.0    34.0    48.0
90  30-07-2023 00:00       49.0   37.0    40.0    43.0
91  31-07-2023 00:00       44.0   51.0    37.0    36.0

In [13]:
data.columns

Index(['date', 'breakfast', 'lunch', 'snacks', 'dinner'], dtype='object')

In [14]:
data2.columns

Index(['date', 'breakfast', 'lunch', 'snacks', 'dinner'], dtype='object')

In [15]:
# turning the breakfast, lunch, snacks and dinner column into integers
data['breakfast'] = data['breakfast'].astype(int)
data['lunch'] = data['lunch'].astype(int)
data['snacks'] = data['snacks'].astype(int)
data['dinner'] = data['dinner'].astype(int)
data.head()

               date  breakfast  lunch  snacks  dinner
0  01-05-2023 00:00        111    195     108     137
1  02-05-2023 00:00         95    175     115     138
2  03-05-2023 00:00         95    203     129     134
3  04-05-2023 00:00         93    184     131     179
4  05-05-2023 00:00        112    121      95     117

In [16]:
data2['breakfast'] = data2['breakfast'].astype(int)
data2['lunch'] = data2['lunch'].astype(int)
data2['snacks'] = data2['snacks'].astype(int)
data2['dinner'] = data2['dinner'].astype(int)
data2.head()

                  date  breakfast  lunch  snacks  dinner
4  2023-08-01 00:00:00         36     39      34      49
5  2023-08-02 00:00:00         43     42      38      41
6  2023-08-03 00:00:00         34     43      32      34
7  2023-08-04 00:00:00         34     51      39      45
8  2023-08-05 00:00:00         54     81      23      39

In [17]:
# creating a column for day of the week
data['day'] = pd.to_datetime(data['date'], dayfirst=True).dt.day_name()
data['month'] = pd.to_datetime(data['date'], dayfirst=True).dt.month_name()
data.head()

               date  breakfast  lunch  snacks  dinner        day month
0  01-05-2023 00:00        111    195     108     137     Monday   May
1  02-05-2023 00:00         95    175     115     138    Tuesday   May
2  03-05-2023 00:00         95    203     129     134  Wednesday   May
3  04-05-2023 00:00         93    184     131     179   Thursday   May
4  05-05-2023 00:00        112    121      95     117     Friday   May

In [18]:
print(len(data))
print(len(data2))

92
31

In [19]:
data2['day'] = pd.to_datetime(data2['date'], dayfirst=True).dt.day_name()
data2['month'] = pd.to_datetime(data2['date'], dayfirst=True).dt.month_name()
data2.head()

                  date  breakfast  lunch  snacks  dinner        day   month
4  2023-08-01 00:00:00         36     39      34      49    Tuesday  August
5  2023-08-02 00:00:00         43     42      38      41  Wednesday  August
6  2023-08-03 00:00:00         34     43      32      34   Thursday  August
7  2023-08-04 00:00:00         34     51      39      45     Friday  August
8  2023-08-05 00:00:00         54     81      23      39   Saturday  August

In [20]:
# concatenating the two datasets
data = pd.concat([data, data2], ignore_index=True)
data[91:100]

                   date  breakfast  lunch  snacks  dinner        day   month
91     31-07-2023 00:00         44     51      37      36     Monday    July
92  2023-08-01 00:00:00         36     39      34      49    Tuesday  August
93  2023-08-02 00:00:00         43     42      38      41  Wednesday  August
94  2023-08-03 00:00:00         34     43      32      34   Thursday  August
95  2023-08-04 00:00:00         34     51      39      45     Friday  August
96  2023-08-05 00:00:00         54     81      23      39   Saturday  August
97  2023-08-06 00:00:00         50     30      24      43     Sunday  August
98  2023-08-07 00:00:00         41     51      28      52     Monday  August
99  2023-08-08 00:00:00         53     35      11      45    Tuesday  August

In [21]:
len(data)

123

In [22]:
data.head()

               date  breakfast  lunch  snacks  dinner        day month
0  01-05-2023 00:00        111    195     108     137     Monday   May
1  02-05-2023 00:00         95    175     115     138    Tuesday   May
2  03-05-2023 00:00         95    203     129     134  Wednesday   May
3  04-05-2023 00:00         93    184     131     179   Thursday   May
4  05-05-2023 00:00        112    121      95     117     Friday   May

In [23]:
data.tail()

                    date  breakfast  lunch  snacks  dinner        day   month
118  2023-08-27 00:00:00        155    371     175     310     Sunday  August
119  2023-08-28 00:00:00        271    450     265     341     Monday  August
120  2023-08-29 00:00:00        237    402     312     356    Tuesday  August
121  2023-08-30 00:00:00        224    377     278     374  Wednesday  August
122  2023-08-31 00:00:00        198    327     251     272   Thursday  August

Key Assumptions:
- Faculty members do not come for breakfast.
- Faculty members do not come for dinner. 
- Faculty members do not come for meals on weekends.

For the month of May: 
- 102 students in UG26
- 86 students in UG25
- 35 from Faculty
- 27 from Staff
- 11 from TLP
Hence, total of 261 people that on average comes for meals.

In [24]:
faculty_number = 35
ug26 = 102
ug25 = 86
staff = 27
mess_workers = 15

def max_footfall(total_number, day):
    if day in ['Saturday', 'Sunday']:
        footfall = total_number - faculty_number - staff
    else:
        footfall = total_number
    return footfall

In [30]:
may_breakfast_max = 215
may_lunch_max = 277
may_snacks_max = 215
may_dinner_max = 215

In [31]:
may = data[data['month'] == 'May']
june = data[data['month'] == 'June']
july = data[data['month'] == 'July']
august = data[data['month'] == 'August']

In [32]:
may.head()

               date  breakfast  lunch  snacks  dinner        day month
0  01-05-2023 00:00        111    195     108     137     Monday   May
1  02-05-2023 00:00         95    175     115     138    Tuesday   May
2  03-05-2023 00:00         95    203     129     134  Wednesday   May
3  04-05-2023 00:00         93    184     131     179   Thursday   May
4  05-05-2023 00:00        112    121      95     117     Friday   May

In [37]:
import warnings
warnings.filterwarnings('ignore')

In [38]:
# creating a new column for footfall for each meal 
may['breakfast_footfall'] = may.apply(lambda x: max_footfall(may_breakfast_max, x['day']), axis=1)
may['lunch_footfall'] = may.apply(lambda x: max_footfall(may_lunch_max, x['day']), axis=1)
may['snacks_footfall'] = may.apply(lambda x: max_footfall(may_snacks_max, x['day']), axis=1)
may['dinner_footfall'] = may.apply(lambda x: max_footfall(may_dinner_max, x['day']), axis=1)

In [39]:
may.head(7)

,date,breakfast,lunch,snacks,dinner,day,month,breakfast_footfall,lunch_footfall,snacks_footfall,dinner_footfall
0,01-05-2023 00:00,111,195,108,137,Monday,May,215,277,215,215
1,02-05-2023 00:00,95,175,115,138,Tuesday,May,215,277,215,215
2,03-05-2023 00:00,95,203,129,134,Wednesday,May,215,277,215,215
3,04-05-2023 00:00,93,184,131,179,Thursday,May,215,277,215,215
4,05-05-2023 00:00,112,121,95,117,Friday,May,215,277,215,215
5,06-05-2023 00:00,107,119,99,156,Saturday,May,153,215,153,153
6,07-05-2023 00:00,85,126,100,166,Sunday,May,153,215,153,153

In [40]:
# creating a column for proportion of people who ate each meal
may['breakfast_proportion'] = may['breakfast']/may['breakfast_footfall']
may['lunch_proportion'] = may['lunch']/may['lunch_footfall']
may['snacks_proportion'] = may['snacks']/may['snacks_footfall']
may['dinner_proportion'] = may['dinner']/may['dinner_footfall']

In [41]:
may.head()

,date,breakfast,lunch,snacks,dinner,day,month,breakfast_footfall,lunch_footfall,snacks_footfall,dinner_footfall,breakfast_proportion,lunch_proportion,snacks_proportion,dinner_proportion
0,01-05-2023 00:00,111,195,108,137,Monday,May,215,277,215,215,0.516279,0.703971,0.502326,0.637209
1,02-05-2023 00:00,95,175,115,138,Tuesday,May,215,277,215,215,0.441860,0.631769,0.534884,0.641860
2,03-05-2023 00:00,95,203,129,134,Wednesday,May,215,277,215,215,0.441860,0.732852,0.600000,0.623256
3,04-05-2023 00:00,93,184,131,179,Thursday,May,215,277,215,215,0.432558,0.664260,0.609302,0.832558
4,05-05-2023 00:00,112,121,95,117,Friday,May,215,277,215,215,0.520930,0.436823,0.441860,0.544186

In [45]:
pd.set_option('display.max_rows', 500)

In [46]:
features = [
    'bogo',
    'celebration',
    'chicken',
    'weekend',
    'exam',
    'guest',
    'holiday',
    'fasting',
    'north',
]

# creating columns for each feature
for feature in features:
    may[feature] = 0

may.head()

,date,breakfast,lunch,snacks,dinner,day,month,breakfast_footfall,lunch_footfall,snacks_footfall,...,dinner_proportion,bogo,celebration,chicken,weekend,exam,guest,holiday,fasting,north
0,01-05-2023 00:00,111,195,108,137,Monday,May,215,277,215,...,0.637209,0,0,0,0,0,0,0,0,0
1,02-05-2023 00:00,95,175,115,138,Tuesday,May,215,277,215,...,0.641860,0,0,0,0,0,0,0,0,0
2,03-05-2023 00:00,95,203,129,134,Wednesday,May,215,277,215,...,0.623256,0,0,0,0,0,0,0,0,0
3,04-05-2023 00:00,93,184,131,179,Thursday,May,215,277,215,...,0.832558,0,0,0,0,0,0,0,0,0
4,05-05-2023 00:00,112,121,95,117,Friday,May,215,277,215,...,0.544186,0,0,0,0,0,0,0,0,0

In [47]:
bogo_days = ['Wednesday', 'Friday']
# updating the bogo column
may.loc[may['day'].isin(bogo_days), 'bogo'] = 1
may.head()

,date,breakfast,lunch,snacks,dinner,day,month,breakfast_footfall,lunch_footfall,snacks_footfall,...,dinner_proportion,bogo,celebration,chicken,weekend,exam,guest,holiday,fasting,north
0,01-05-2023 00:00,111,195,108,137,Monday,May,215,277,215,...,0.637209,0,0,0,0,0,0,0,0,0
1,02-05-2023 00:00,95,175,115,138,Tuesday,May,215,277,215,...,0.641860,0,0,0,0,0,0,0,0,0
2,03-05-2023 00:00,95,203,129,134,Wednesday,May,215,277,215,...,0.623256,1,0,0,0,0,0,0,0,0
3,04-05-2023 00:00,93,184,131,179,Thursday,May,215,277,215,...,0.832558,0,0,0,0,0,0,0,0,0
4,05-05-2023 00:00,112,121,95,117,Friday,May,215,277,215,...,0.544186,1,0,0,0,0,0,0,0,0

In [49]:
chicken_days = ['Monday', 'Wednesday', 'Friday']
# updating the chicken column
may.loc[may['day'].isin(chicken_days), 'chicken'] = 1
may.head()

,date,breakfast,lunch,snacks,dinner,day,month,breakfast_footfall,lunch_footfall,snacks_footfall,...,dinner_proportion,bogo,celebration,chicken,weekend,exam,guest,holiday,fasting,north
0,01-05-2023 00:00,111,195,108,137,Monday,May,215,277,215,...,0.637209,0,0,1,0,0,0,0,0,0
1,02-05-2023 00:00,95,175,115,138,Tuesday,May,215,277,215,...,0.641860,0,0,0,0,0,0,0,0,0
2,03-05-2023 00:00,95,203,129,134,Wednesday,May,215,277,215,...,0.623256,1,0,1,0,0,0,0,0,0
3,04-05-2023 00:00,93,184,131,179,Thursday,May,215,277,215,...,0.832558,0,0,0,0,0,0,0,0,0
4,05-05-2023 00:00,112,121,95,117,Friday,May,215,277,215,...,0.544186,1,0,1,0,0,0,0,0,0

In [50]:
weekend_days = ['Saturday', 'Sunday']
# updating the weekend column
may.loc[may['day'].isin(weekend_days), 'weekend'] = 1
may.head()

,date,breakfast,lunch,snacks,dinner,day,month,breakfast_footfall,lunch_footfall,snacks_footfall,...,dinner_proportion,bogo,celebration,chicken,weekend,exam,guest,holiday,fasting,north
0,01-05-2023 00:00,111,195,108,137,Monday,May,215,277,215,...,0.637209,0,0,1,0,0,0,0,0,0
1,02-05-2023 00:00,95,175,115,138,Tuesday,May,215,277,215,...,0.641860,0,0,0,0,0,0,0,0,0
2,03-05-2023 00:00,95,203,129,134,Wednesday,May,215,277,215,...,0.623256,1,0,1,0,0,0,0,0,0
3,04-05-2023 00:00,93,184,131,179,Thursday,May,215,277,215,...,0.832558,0,0,0,0,0,0,0,0,0
4,05-05-2023 00:00,112,121,95,117,Friday,May,215,277,215,...,0.544186,1,0,1,0,0,0,0,0,0